Training Started...

Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
word_embedding (InputLayer)  [(None, 100)]             0         
_________________________________________________________________
char_embedding (InputLayer)  [(None, 24)]              0         
_________________________________________________________________
stats_features (InputLayer)  [(None, 4)]               0         
_________________________________________________________________
dense_27 (Dense)             (None, 128)              12928     
_________________________________________________________________
dense_28 (Dense)             (None, 128)              3200      
_________________________________________________________________
dense_29 (Dense)             (None, 128)              640       
_________________________________________________________________
lambda_3 (Lambda)            (None, 3, 128)           0         
_________________________________________________________________
attention_fusion (Lambda)    (None, 128)              0         
_________________________________________________________________
dense_31 (Dense)             (None, 64)               8256      
_________________________________________________________________
dropout_3 (Dropout)         (None, 64)               0         
_________________________________________________________________
dense_32 (Dense)             (None, 2)                130       
=================================================================
Total params: 25,154
Trainable params: 25,154
Non-trainable params: 0
Training started...

Epoch 1/100, Validation Accuracy: 0.85
Epoch 2/100, Validation Accuracy: 0.87
...
Test Accuracy: 0.88

Best Epoch: 2
Best Validation Accuracy: 0.87
Training completed.
